{"review_id":"ZKvDG2sBvHVdF5oBNUOpAQ","user_id":"wSTuiTk-sKNdcFyprzZAjg","business_id":"B5XSoSG3SfvQGtKEGQ1tSQ","stars":3.0,"useful":1,"funny":1,"cool":0,"text":"This easter instead of going to Lopez Lake we went to Los Padres National Forest which is really pretty but if you go to white rock the staff needs to cut down all the dead grass that invades the rock and the water. I would wish the staff would also clean or get rid of the dead grass that's also living by the water. The water is really green and dirty. Los padres national forest staff need to work hard to maintain this forest looking pretty and not like a dumpster. Even Cachuma lake looks like they put a bit more effort.","date":"2016-03-30 22:46:33"}
{"review_id":"pUycOfUwM8vqX7KjRRhUEA","user_id":"59MxRhNVhU9MYndMkz0wtw","business_id":"gebiRewfieSdtt17PTW6Zg","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Had a party of 6 here for hibachi. Our waitress brought our separate sushi orders on one plate so we couldn't really tell who's was who's and forgot several items on an order. I understand making mistakes but the restaraunt was really quiet so we were kind of surprised. Usually hibachi is a fun lively experience and our  cook  said maybe three words, but he cooked very well his name was Francisco. Service was fishy, food was pretty good, and im hoping it was just an off night here. But for the money I wouldn't go back.","date":"2016-07-25 07:31:06"}
{"review_id":"eCiWBf1CJ0Zdv1uVarEhhw","user_id":"OhECKhQEexFypOMY6kypRw","business_id":"vC2qm1y3Au5czBtbhc-DNw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Yes, this is the only sushi place in town. However, it is great when you're craving sushi and don't have time to go somewhere else. The salmon is probably the best fish they have, so we always order salmon. We also love their spicy edamame, tempura, ocean salad, and cabbage salad. Service has always been friendly and quick!","date":"2013-09-04 03:48:20"}
{"review_id":"YbMyvlDA2W3Py5lTz8VK-A","user_id":"4hBhtCSgoxkrFgHa4YAD-w","business_id":"bbEXAEFr4RYHLlZ-HFssTA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great burgers,fries and salad!  Burgers have a hint of salt and pepper flavor.\n\nThis location is very quaint. They only have outdoor seating\n\nFriendly staff.\n\nStreet parking as well as parking lot in the back.","date":"2017-01-02 03:17:34"}
{"review_id":"L0jv8c2FbpWSlfNC6bbUEA","user_id":"bFPdtzu11Oi0f92EAcjqmg","business_id":"IDtLPgUrqorrpqSLdfMhZQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"What a great addition to the Funk Zone!  Grab a bite, grab some tastings, life is good. Right next door to the Santa Barbara Wine Collective, in fact it actually shares the same tables.  We had a fabulous savory croissant.","date":"2016-10-13 22:50:47"}
{"review_id":"2u5Skti5mZam_-XTKPelvA","user_id":"IMd3NQbclta91pFKk3AJZg","business_id":"qO9dNNIvNbCBd8ZgjxMxgQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Farmhouse, rustic, chic.Helpful staff with great ideas to decorate your home. Prices reasonable. Store has items from Joanna Gaines ( Fixer Upper) and much more. Finally a good home store in SB with reasonable prices.","date":"2017-04-08 00:33:11"}
{"review_id":"4zopEEPqfwm-c_FNpeHZYw","user_id":"JYYYKt6TdVA4ng9lLcXt_g","business_id":"SZU9c8V2GuREDN5KgyHFJw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We were a bit weary about trying the Shellfish Company on the Wharf as more often than not, many places like these (see Cannery Row, Monterey) feast on a captive audience and provide sub-standard fare at high prices.\n\nHowever, emboldened by the perennial good reviews on Yelp, we suppressed our initial observations and went ahead with the trying it out. The place is small, so definitely plan ahead. You will have to wait, so either you know, just do so, or perhaps try to visit outside of peak hours. Luckily, our wait was only about 20 minutes as the dinner rush was just leveling off.\n\nThe special was the local rock crab - $25 for 3 lbs of California Rock Crab, salad, and your choice of soup\/chowder. After taking a look at a few trays of rock crab being served out, the wife and I both opted for it, as it looked awesome.  \n\nThe salad\/chowder combo was great as you actually received hearty portions of each, so it was a good start. As much as I liked the chowder however, the Shrimp Bisque the wife ordered was amazing, so I would recommend that going forward. \n\nBut enough of prattling on about side dishes: the rock crab tasted just as glorious as it looked. Juicy, buttery chunks of white crab meat await you, just a few cracks away. While the rock crab shells are pretty thick, once cracked, they splinter and separate easily, a good sign they are cooked to perfection. The rock crabs provided a great amount of meat for what I felt to be the least amount of work you're going to do for crab, King or otherwise. \n\nWe were thoroughly satisfied with our meal and along with the special being an overall great value, devouring the Rock Crab at SBSC turned out to be one of the favorite meals on the trip. I think ordering crab here is a safe proposition indeed.","date":"2016-05-31 02:14:54"}
{"review_id":"HuWEnZr7-0HveaqXxyywgg","user_id":"Eb8LgZArKmW0KgW6lTni-w","business_id":"YbnJYHNp_fHbI-hcFg48vQ","stars":5.0,"useful":2,"funny":0,"cool":2,"text":"The kayaking tour at the Santa Cruz Island was great.  My husband and I had a wonderful time.  Jen, our tour guide, was helpful and informative.  We had a lot of fun exploring the caves.  We didn't expect much but this tour definitely exceeded our expectation.","date":"2009-08-03 21:55:27"}
{"review_id":"PDHRlnEdkEcwATry4w71PQ","user_id":"UsBxLh14sUpO8SdeqIiGOA","business_id":"Wy8Hswf2cLQGRZN6armkag","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"If I could give it a zero, I would. I order a plain hamburger, and realized they put  bacon in it (which I am allergic to and unable to eat) after two bites. When I went back to the drive-through window to complain (didn't realize the actual restaurant was open--it was almost 2 after all...), the guy took back the burger, said nothing, and disappeared. After 2 minutes of awkwardly making conversation with the next people in line in their car, he came back and rudely told me I had to go inside to get my food. Which I did. And still did not get an apology.\n\nI refuse to go back there after that ordeal, which is a shame, because it's nice to have a variety of places to go to after DT. Guess Freebirds it is!","date":"2011-08-24 23:07:08"}
{"review_id":"5obXxR0b94b5q6j1zYCAzw","user_id":"3inG_FUhm28tUJc0zZ2fCg","business_id":"aY_n9RSaD2Yw09jSFFePew","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"We visited once and were very disappointed in my veggie pizza and my husband's sub sandwich.  The tomato sauce was not tasty, and they did not use enough cheese on my pizza.  The dough looked and tasted like it was prepared by a machine.  Perhaps they have improved, but we are not in any rush to try a second time.","date":"2017-08-16 15:43:19"}
{"review_id":"GK5JEpizD-nDGXsJUYVLTg","user_id":"9QpNZ4-0gJow6xj-6OZe8Q","business_id":"6JFTijOMHB46yBoyVOjPCA","stars":4.0,"useful":0,"funny":1,"cool":0,"text":"The court house is very old and the art is great. The spiral staircase is funny. One can get view of entire city from 5th level. The tower clock room is really surprising with all mechanical gears inside!! You need a prior appointment to get into clock room. Worth spending 2 to 3 hours of time here.","date":"2015-08-30 16:48:31"}
{"review_id":"byblHsbxiqb1pC1cuSfslA","user_id":"C_2mNjl-doRVvsL03_T57Q","business_id":"18eWJFJbXyR9j_5xfcRLYA","stars":4.0,"useful":7,"funny":0,"cool":0,"text":"This is the first time I tried this place and  I was surprisingly surprised. I had a combination dinner pad Thai and coconut soup. The soup was very tasty as I never had coconut soup before. The pad Thai was exactly what I was expecting and it did not disappoint. The restaurant had great Thai decor and music. The staff and service was top notch. For a town with not much selection for food, this was a great change of pace. This may become my go to place in Carp.","date":"2011-10-28 03:43:05"}
{"review_id":"SpmKsFnwg35PTgCVujOOJA","user_id":"RiQWbgwR-asiU_mA7s8gpg","business_id":"pUVRCYL8rT4I5Ry5FYkRsA","stars":5.0,"useful":2,"funny":0,"cool":1,"text":"Sweet spot in the Waterline. Came for some live music with friends on Saturday. Very cool. Best local beer in town by far. Seems like the concept is a few notches up from Fig Mountain. Definitely prefer Topa. Even cooler is that you can order incredible food from the Nook Restaurant, and walk two feet into Lama Dog which is part of the Waterline. I love it!!","date":"2016-12-19 22:58:19"}
{"review_id":"zM7u3iffMjniyvQAaN9Tnw","user_id":"QacYrFyCrFLmC726YEEBsA","business_id":"29YqJwOGEuAWqlHZxMc1OA","stars":1.0,"useful":0,"funny":1,"cool":0,"text":"So disappointing on so many levels. Have been coming here for years - and the quality of food has fallen off a cliff. Strike one - we shared an artichoke to start - and clearly it had been prepared beforehand (eg, cold on the inside - but the flesh was cooked through)  Strike two - my wife had a Greek salad - and it clearly all came from a bag and was extremely overdressed with tasteless dressing.  Strike three - I had grilled yellowtail which was basically execrable - could not even finish it (overcooked and an inferior-frozen piece of fish - unacceptable for SB). \n\nIn short - great setting, good service - but with such horrible food - not worth the visit. This place really needs to up the quality of food - or it's going to end up just another lower State dive for the tourists.","date":"2012-05-29 03:51:08"}
{"review_id":"Gczff1Qxg4WVmlBLPrZwzQ","user_id":"cpp89UW0imv45y3a_O444w","business_id":"34Eqv8jXgxg_EEwcsNgeeg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We absolutely love everything we have tried here. Our favorite thus far has been the Backyard Bowl, although there are several more that we still need to try. My husband and I are always full after we each get a kids size, or split a large. The ingredients are good quality,  filling foods. For the quality of ingredients, the price is very reasonable. It can get pretty busy here, but have patience, it is worth the wait.","date":"2014-05-25 22:33:02"}
{"review_id":"bi6GaeWDGceGv62lXTIKQA","user_id":"RgtbLaiU22zqaCk20HgbiQ","business_id":"bjhCtlYHrkgA5Ku8l-rB3g","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Very disappointed. We went to eat  at 2:15 on Saturday and were told the kitchen closed at 2. Their website says: Sat & Sun all day. Their website claims that they are open until 5.\nI'm always a bit suspect of places that can't manage simple details like their hours on their website. It makes me wonder about the awareness to quality and other \"small\" items.","date":"2015-01-04 02:26:46"}
{"review_id":"-b1TKCO3GfYyXXvtDQq7qA","user_id":"cD2kobXH5ozNOjAMS5yuvQ","business_id":"fWbQiSAErNcznezzkfCdvg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I am an amateur athlete. I first met Dr. Ferrel when I was playing softball. He was watching my game when I was severely injured.  He treated me on the field by relocating my ankle and then told me to come to his office for treatment. I told him I could not afford that as a single mom on a teacher's salary. Instead, I saw a physician. He said it would be months before I would play again. Depressed and without much hope, I reached out to Dr. Ferrel again. He did treat me as he promised. Not only did he treat me, he healed me within weeks instead of months. Over the years Dr. Ferrel has worked on me with amazing results each time. He will always be my hero...","date":"2015-04-28 19:27:58"}
{"review_id":"LO2C_mywzQy5BvdEeONR1A","user_id":"jvURGq9nyZkTF1KuSaZC_g","business_id":"CYwC5OjwCN6ib_AQDxi3Ow","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Love in n out. There's just a mood for in n out that you have to fulfill sometimes.\n\nWhat can I say. 4 patties animal style bruh","date":"2016-08-12 21:30:55"}
{"review_id":"H4mSxGeKTv4VFcc9YUmtpQ","user_id":"oGV84fsuRbLQRRQ6ZZC1dA","business_id":"-kY_HDP7IMvGl-kBIZVU4A","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The espresso here is excellent. My favorite place to come for an Americano. The staff is polite and friendly and vibes are mellow. It is important to know that there is no access to power outlets, but unlimited wifi access. The bathrooms and the rest of the establishment are always clean.","date":"2016-07-14 19:43:42"}
{"review_id":"YS8WO_OW6oYFQhH85aRXew","user_id":"I7ugU8kU4bPh4UL90yJanQ","business_id":"eL4lyE7LNoXEMvpcJ8WNVw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Great, beautiful spot to do wine tasting. I loved all the wines I tried, great prices as well as service. I had a good","date":"2016-12-04 16:55:51"}
{"review_id":"fgreXhTAyKbGiC0f9ZLd0A","user_id":"0VMuCPgwZliInxGWfJnxKQ","business_id":"25Uww0C0wvF9CZ_3B6vWtA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"We set up an online appt, meeting and transaction was very simple and painless. We opted for a 2hr side by side ride where we had a four-seater with our guide Matt (who by the way was super awesome and informative).  Throughly enjoyed our ride with some superb views.","date":"2016-07-04 00:23:48"}
{"review_id":"cC79tWLtH1U1n-oi7EozMw","user_id":"FNf6kM1wfeBeB2UW6pif7g","business_id":"qdpdUjdkEUpzYDdce2yZng","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The line was out the door, but I had a sandwich in my hands 7 minutes later, and I'm guessing it took longer because I didn't know what I wanted right away.  In fact, I felt a little rushed.  All the locals were running in, saying hi to the owner and ordering up their usual's.  No place for a rookie, but they were extremely patient with us and a few others that wandered in not knowing what they were doing either.\n\nAs soon as you cross the threshold, you know you have made a good choice, the smell makes your mouth water.  The Punk agreed so we decided to sit inside (everyone else was outside).\n\nTypically, I would never ever order pastrami, but the menu said it was lean, so I tried something different for me.  Lean indeed.  Best pastrami I have had in a very long time.  In fact, maybe ever.  \n\nThe punk was amazed at all the bottle caps glued to every surface in the place.  It is a visual feast to keep you busy and entertained while you eat, if you choose to eat inside.  You cannot see the walls for all the nostalgic fodder.\n\nShe was especially thrilled when they brought out her sandwich. When he set it down she exclaimed with delight, \"He knew exactly what I wanted!\"","date":"2016-11-09 19:58:45"}
{"review_id":"dpgq69tsI2f_GpRH71hQsA","user_id":"Uk3X2AypU8AqvcYEVf7s6Q","business_id":"eL4lyE7LNoXEMvpcJ8WNVw","stars":3.0,"useful":5,"funny":0,"cool":0,"text":"This was a tough one!   On the merits of the wine, fairly average... I understand that the winery has more than one lable and other label is their premium wines.  I look forward to when that is available (I went two weeks ago so maybe it already is)     Location..   what's not to like?  On the pier!  A wonderful outdoor patio,  couldn't have a nicer setting to enjoy your tasting....   The staff were super, super nice,  I would give them an A+!  \n\nSo why only three stars?  It is because of the wine club!  Very expensive for the quality of the wines and stingy as HELL with the benefits to the members..   Most wine clubs will give you a free tasting every time you come in (after all, we are your best customers... we are the ones who buy your wine time and time again).  Some wineries will give their members a complimentary glass in leau of a tasting (Carr).   Most wineries allow you to bring guests which is how you get new wine club members.   This system works folks!  The way this wine club works is that you are given a very limited number of passes per quarter, five as I recall.   If I come with my wife once a month we wouldn't even be covered... let alone if we bring a guest!   \n\nSo go to this winery if you want to enjoy a tasting in one of the most beautiful settings on earth.   But avoid the wine club!  For that you can pretty much go to any of the other wine tasting rooms on the Urban wine trail.","date":"2011-08-25 16:14:24"}